{
  "Tips": {
    "Well Formed": "When creating your user stories, make sure that there is a Role, an Action and a Benefit - and that these match with each other! Reread the context carefully when you are unsure of the possible matches.",
    "Atomic": "Your user stories should tackle only one issue at a time. Hint: search for the word 'and' within either an action or a benefit, for this work usually refers to multiple problems within one user story - therefore not atomic!",
    "Minimal": "Your user stories should contain only a role, an action and a benefit. Additional information such as examples and extra descriptions make your  story not minimal.",
    "Problem Oriented": "Always check if your user stories only specify problems, not solutions. References to technologies, programs, or resources generally indicate your story is not problem oriented!",
    "Full Sentence": "Check if your user story is a grammatically correct sentence in English. Avoid partial sentences without subject or verb.",
    "Unambiguous": "Your written user stories should prevent multiple interpretations. Are there phrases or words like 'things', 'the duties', 'to manage' that are too vague and could mean anything? Then the user story is not unambiguous!",
    "Independent": "Make sure that your user stories stand on their own. Pointers towards other artifacts (e.g., 'please see user story 8' or 'check the pdf') make your user story not independent!"
  },
  "Introductions": {
    "Tutorial": {
      "nr": 19,
      "nr2": 13,
      "1": [
        "Welcome to BakeRE!"
      ],
      "2": [
        "In this game, you author user stories by making cakes.",
        "",
        "Every cake consists of three ingredients: cake bottom, icing and decorations.",
        "This mirrors the makeup of a user story with their Role-Action-Benefit structure."
      ],
      "3": [
        "A structurally correct user story has the following format:",
        "",
        "'As a <Role> I want to <Action> so that <Benefit>'"
      ],
      "4": [
        "To complete a batch of cakes, you have to complete all correct user stories in that batch,",
        "",
        "and to complete a level, you have to complete all batches in the level."
      ],
      "5": [
        "The progress bar on the left shows",
        "your progress within a level."
      ],
      "6": "#1",
      "7": [
        "On the right, you see the user story menu."
      ],
      "8": "#2",
      "9": [
        "To write a user story, you pick one role/bottom, one action/icing, and one benefit/decoration and combine them into a cake.",
        "",
        "Try it out by opening the 'Role'/'Cake bottom' menu!"
      ],
      "10": "#3",
      "11": [
        "Here, you can pick your ingredients and drag them to the dish on the left.",
        "",
        "Try it out now!"
      ],
      "12": "#4",
      "13": [
        "Good job! The cake you are creating is mapped to your user story at the bottom of the screen."
      ],
      "14":
        "#5",
      "15": [
        "When you combine three ingredients, BakeRE evaluated your user story and, if correct, you gain points (the faster, the more points)."
      ],
      "16": "#6",
      "17": [
        "When a user story is incorrect, points are detracted, so be careful! Sometimes being precise is better than being fast.",
        "",
        "(Points gained in the tutorial do not add up to your score)"
      ],
      "18": [
        "With this in mind, complete the three user stories in this batch to finish the tutorial.",
        "",
        "You will now see the context of the batch of user stories.",
        "To take another look at the context, press the pause button."
      ],
      "19": [
        "You can always replay the tutorial if necessary.",
        "",
        "Good luck!"
      ]
    },
    "User story Structure": {
      "nr": 3,
      "1": [
        "Welcome back!"
      ],
      "2": [
        "To win this level, complete again all user stories across the different batches.",
        "",
        "You can always review the context by pausing BakeRE."
      ],
      "3": [
        "Good luck!"
      ]
    },
    "Quality Framework QUS": {
      "nr": 5,
      "1": [
        "Welcome back!"
      ],
      "2": [
        "From this level forward, we introduce faulty user stories into the mix.",
        "",
        "These user stories can be structurally correct, but do not comply with some of the QUS quality criteria.",
        "To complete the level, associate all correct user stories and leave out the faulty ones."
      ],
      "3": [
        "The QUS categories to focus on are:",
        "",
        "Full Sentence",
        "Atomic",
        "Minimal"
      ],
      "4": [
        "For a refresher on the categories, open the pause menu and click the corresponding category name." 
      ],
      "5": [
        "Good luck!"
      ]
    },
    "Quality Framework QUS - continued": {
      "nr": 5,
      "1": [
        "Welcome back!"
      ],
      "2": [
        "To win this level, complete all user stories across the batches without associating the faulty ones."
      ],
      "3": [
        "The QUS categories to focus on are:",
        "",
        "Independent",
        "Unambiguous",
        "Problem Oriented"
      ],
      "4": [
        "You can always review the context by opening the pause menu,",
        "which also shows a refresher of those categories."
      ],
      "5": [
        "Good luck!"
      ]
    },
    "Acceptance Tests": {
      "nr": 6,
      "1": [
        "Welcome back!"
      ],
      "2": [
        "In this final level, we look at the back of a user story car: acceptance tests."
      ],
      "3": [
        "We follow Dan North's syntax:",
        "",
        "'Given <some context>, When <some action is carried out>, Then <some observable consequence occurs>'."
      ],
      "4": [
        "Create correct acceptance tests given the context (a user story, in this case).",
        "",
        "Just like before, complete all batches to complete the level."
      ],
      "5": [
        "There are no mistakes in this level: every acceptance test has to be completed."
      ],
      "6": [
        "Good luck!"
      ]
    },
    "Flawless user story": {
      "nr": 3,
      "1": [
        "Welcome back!"
      ],
      "2": [
        "To complete this level, you have to create at least one flawless user story from the next batches!",
        "",
        "Every time you make a mistake, the batch is renewed; focus and provide the right answer!"
      ],
      "3": [
        "Good luck!"
      ]
    }
  }
}